{
  "recipes": [
    {
      "id": "5875",
      "title": "Classic Homemade Burger",
      "description": "A juicy and flavorful burger made from scratch, perfect for a weekend treat or family dinner. Customize with your favorite toppings for a personalized touch.",
      "ingredients": [
        "Burger Patty:\n500g ground beef (80% lean",
        "20% fat)\n1 small onion",
        "finely chopped\n1 clove garlic",
        "minced\n1 tsp salt\n1/2 tsp black pepper\n1 tsp Worcestershire sauce\n1 tsp paprika\n1 egg (optional",
        "for binding)\nBurger Assembly:\n4 burger buns\n4 slices of cheese (optional)\nLettuce leaves\n1 tomato",
        "sliced\n1 onion",
        "sliced into rings\nPickles (optional)\nKetchup",
        "mayonnaise",
        "and mustard (to taste)"
      ],
      "steps": "Prepare the Patty Mixture:\n\nIn a large bowl, mix ground beef, onion, garlic, salt, pepper, Worcestershire sauce, paprika, and egg. Combine well without over-mixing.\nShape the Patties:\n\nDivide the mixture into 4 equal portions and shape into patties about 1/2 inch thick. Make a small indent in the center to prevent puffing during cooking.\nCook the Patties:\n\nHeat a grill or frying pan over medium-high heat. Cook patties for about 3-4 minutes on each side, or until desired doneness. Add cheese slices during the last minute of cooking if desired.\nToast the Buns:\n\nLightly toast the burger buns on the grill or in a skillet for extra flavor.\nAssemble the Burgers:\n\nSpread condiments (ketchup, mayonnaise, mustard) on the buns. Add lettuce, tomato slices, onion rings, and pickles. Place the cooked patty on top, cover with the bun, and serve.",
      "tags": [
        "Comfort",
        "Food",
        "American Cuisine",
        "Quick Meals",
        "Grilled"
      ],
      "difficulty": "Easy",
      "dateAdded": "2024-12-31T19:48:29.997Z",
      "dateModified": "2024-12-31T19:48:29.997Z"
    },
    {
      "id": "3570",
      "title": "Spaghetti Carbonara",
      "description": "A creamy, comforting Italian pasta dish made with eggs, cheese, pancetta, and pepper. Perfect for a quick yet indulgent meal.",
      "ingredientsList": [
        "400g spaghetti",
        "150g pancetta or guanciale (diced)",
        "2 large eggs",
        "2 large egg yolks",
        "1 cup (100g) grated Pecorino Romano or Parmesan cheese",
        "2 cloves garlic (minced)",
        "1 tsp freshly ground black pepper Salt to taste"
      ],
      "steps": "Bring a large pot of salted water to a boil and cook the spaghetti according to package instructions until al dente. Reserve 1 cup of pasta water before draining. In a bowl, whisk together the eggs, egg yolks, and grated cheese until smooth. Set aside. Heat a large skillet over medium heat and cook the pancetta until crispy, about 5–7 minutes. Add minced garlic and sauté for an additional minute. Reduce the skillet's heat to low. Add the drained spaghetti to the skillet with the pancetta, tossing to coat. Remove the skillet from heat. Quickly pour the egg and cheese mixture over the pasta, stirring vigorously to create a creamy sauce. Add a splash of reserved pasta water if the sauce is too thick. Season with freshly ground black pepper and adjust salt to taste. Serve immediately, garnished with extra cheese and black pepper if desired.",
      "tags": [
        "Italian",
        "Pasta",
        "Quick Meals",
        "Comfort Food",
        "One-Pot Dish"
      ],
      "difficulty": "Easy",
      "ingredients": [
        "400g spaghetti",
        "150g pancetta or guanciale (diced)",
        "2 large eggs",
        "2 large egg yolks",
        "1 cup (100g) grated Pecorino Romano or Parmesan cheese",
        "2 cloves garlic (minced)",
        "1 tsp freshly ground black pepper Salt to taste"
      ],
      "dateAdded": "2025-01-03T13:40:18.945Z",
      "dateModified": "2025-01-03T13:40:18.945Z"
    }
  ],
  "messages": [
    {
      "id": "d53e",
      "subject": "sdfsdf",
      "email": "sdfsdf@sdfds.com",
      "message": "sdfdsf"
    },  
    {
      "id": "1f89",
      "subject": "sdfggb",
      "email": "ffds@dfgfdg.com",
      "message": "dfg"
    }
  ]
}